[
  {
    "id": "OL59681W",
    "title": "Stranger in a Strange Land",
    "author": "Robert A. Heinlein",
    "publishYear": 1961,
    "description": "Stranger in a Strange Land is a 1961 science fiction novel by American author Robert A. Heinlein. It tells the story of Valentine Michael Smith, a human who comes to Earth in early adulthood after being born on the planet Mars and raised by Martians. The novel explores his interaction with—and eventual transformation of—terrestrial culture. The title is an allusion to the phrase in Exodus 2:22. According to Heinlein, the novel's working title was The Heretic. Several later editions of the book have promoted it as \"The most famous Science Fiction Novel ever written\".",
    "genre": "science fiction",
    "pages": 475,
    "cover": "http://covers.openlibrary.org/b/id/1468460-L.jpg"
  },
  {
    "id": "OL46125W",
    "title": "Foundation",
    "author": "Isaac Asimov",
    "publishYear": 1951,
    "description": "One of the great masterworks of science fiction, the Foundation novels of Isaac Asimov are unsurpassed for their unique blend of nonstop action, daring ideas, and extensive world-building. \r\n\r\nThe story of our future begins with the history of Foundation and its greatest psychohistorian: Hari Seldon.  For twelve thousand years the Galactic Empire has ruled supreme. Now it is dying.  Only Hari Seldon, creator of the revolutionary science of psychohistory, can see into the future--a dark age of ignorance, barbarism, and warfare that will last thirty thousand years. To preserve knowledge and save mankind, Seldon gathers the best minds in the Empire--both scientists and scholars--and brings them to a bleak planet at the edge of the Galaxy to serve as a beacon of hope for future generations. He calls his sanctuary the Foundation.\r\n\r\nBut soon the fledgling Foundation finds itself at the mercy of corrupt warlords rising in the wake of the receding Empire. And mankind's last best hope is faced with an agonizing choice: submit to the barbarians and live as slaves--or take a stand for freedom and risk total destruction.",
    "genre": "science fiction",
    "pages": 249,
    "cover": "http://covers.openlibrary.org/b/id/6501822-L.jpg"
  },
  {
    "id": "OL46241W",
    "title": "I, Robot",
    "author": "Isaac Asimov, Rowena Akinyemi, Tricia Reilly",
    "publishYear": 1950,
    "description": "I, Robot is a fixup novel of science fiction short stories or essays by American writer Isaac Asimov. The stories originally appeared in the American magazines Super Science Stories and Astounding Science Fiction between 1940 and 1950 and were then compiled into a book for stand-alone publication by Gnome Press in 1950, in an initial edition of 5,000 copies. The stories are woven together by a framing narrative in which the fictional Dr. Susan Calvin tells each story to a reporter (who serves as the narrator) in the 21st century. Although the stories can be read separately, they share a theme of the interaction of humans, robots, and morality, and when combined they tell a larger story of Asimov's fictional history of robotics.\r\n\r\n\r\n----------\r\n\r\nContains:\r\n\"Introduction\" (the initial portion of the framing story or linking text)\r\n\"[Robbie](https://openlibrary.org/works/OL46260W)\" (1940, 1950)\r\n\"Runaround\" (1942)\r\n\"Reason\" (1941)\r\n\"Catch That Rabbit\" (1944)\r\n\"Liar!\" (1941)\r\n\"Little Lost Robot\" (1947)\r\n\"Escape!\" (1945)\r\n\"Evidence\" (1946)\r\n\"The Evitable Conflict\" (1950)\r\n\r\n\r\n----------\r\nContained in:\r\n[Great Science Fiction Stories](https://openlibrary.org/works/OL36759365W)",
    "genre": "science fiction",
    "pages": 224,
    "cover": "http://covers.openlibrary.org/b/id/12385229-L.jpg"
  },
  {
    "id": "OL52267W",
    "title": "The Time Machine",
    "author": "H. G. Wells",
    "publishYear": 1895,
    "description": "The Time Traveller, a dreamer obsessed with traveling through time, builds himself a time machine and, much to his surprise, travels over 800,000 years into the future. He lands in the year 802701: the world has been transformed by a society living in apparent harmony and bliss, but as the Traveler stays in the future he discovers a hidden barbaric and depraved subterranean class. Wells's transparent commentary on the capitalist society was an instant bestseller and launched the time-travel genre.",
    "genre": "science fiction",
    "pages": 120,
    "cover": "http://covers.openlibrary.org/b/id/9009316-L.jpg"
  },
  {
    "id": "OL450124W",
    "title": "The Last Man",
    "author": "Mary Wollstonecraft Shelley",
    "publishYear": 1826,
    "description": "Mary Shelley, the author of [*Frankenstein*][1], wrote the apocalyptic novel The Last Man in 1826. Its first person narrative tells the story of our world standing at the end of the twenty-first century and - after the devastating effects of a plague - at the end of humanity. In the book Shelley writes of weaving this story from a discovery of prophetic writings uncovered in a cave near Naples. The Last Man was made into a 2008 film.\r\n\r\n\r\n  [1]: http://openlibrary.org/works/OL450125W/Frankenstein",
    "genre": "science fiction",
    "pages": 414,
    "cover": "http://covers.openlibrary.org/b/id/882662-L.jpg"
  },
  {
    "id": "OL13703833W",
    "title": "Poetics",
    "author": "Aristotle, Leon Golden, O. B. Hardison",
    "publishYear": 1536,
    "description": "One of the first books written on what is now called aesthetics. Although parts are lost (e.g., comedy), it has been very influential in western thought, such as the part on tragedy.",
    "genre": "music",
    "pages": 128,
    "cover": "http://covers.openlibrary.org/b/id/6528920-L.jpg"
  },
  {
    "id": "OL27495W",
    "title": "The Silmarillion",
    "author": "J.R.R. Tolkien",
    "publishYear": 1800,
    "description": "A number-one New York Times bestseller when it was originally published, The Silmarillion is the core of J.R.R. Tolkien's imaginative writing, a work whose origins stretch back to a time long before The Hobbit.",
    "genre": "music",
    "pages": 431,
    "cover": "http://covers.openlibrary.org/b/id/10832348-L.jpg"
  },
  {
    "id": "OL261794W",
    "title": "A Clockwork Orange",
    "author": "Anthony Burgess",
    "publishYear": 1962,
    "description": "A Clockwork Orange is a dystopian satirical black comedy novel by English writer Anthony Burgess, published in 1962. It is set in a near-future society that has a youth subculture of extreme violence. The teenage protagonist, Alex, narrates his violent exploits and his experiences with state authorities intent on reforming him. The book is partially written in a Russian-influenced argot called \"Nadsat\", which takes its name from the Russian suffix that is equivalent to '-teen' in English. According to Burgess, it was a jeu d'esprit written in just three weeks.\r\n\r\nIn 2005, A Clockwork Orange was included on Time magazine's list of the 100 best English-language novels written since 1923, and it was named by Modern Library and its readers as one of the 100 best English-language novels of the 20th century. The original manuscript of the book has been kept at McMaster University's William Ready Division of Archives and Research Collections in Hamilton, Ontario, Canada since the institution purchased the documents in 1971. It is considered one of the most influential dystopian books.\r\n\r\n----------\t\t\r\nAlso contained in:\t\t\r\n\r\n[A Clockwork Orange and Honey for the Bears](https://openlibrary.org/works/OL23787405W)\r\n[A Clockwork Orange / The Wanting Seed](https://openlibrary.org/works/OL17306508W)",
    "genre": "music",
    "pages": 192,
    "cover": "http://covers.openlibrary.org/b/id/13151224-L.jpg"
  },
  {
    "id": "OL74504W",
    "title": "White Fang",
    "author": "Jack London",
    "publishYear": 1905,
    "description": "The story of a wolf/dog cross, who is raised by Indians, and becomes a deadly fighter.",
    "genre": "music",
    "pages": 237,
    "cover": "http://covers.openlibrary.org/b/id/8236920-L.jpg"
  },
  {
    "id": "OL166973W",
    "title": "Идіотъ",
    "author": "Фёдор Михайлович Достоевский",
    "publishYear": 1880,
    "description": "Inspired by an image of Christ's suffering, Fyodor Dostoyevsky set out to portray \"a truly beautiful soul\" colliding with the brutal reality of contemporary society. Returning to St. Petersburg from a Swiss sanatorium, the gentle and naive Prince Myshkin—known as \"the idiot\"—pays a visit to his distant relative General Yepanchin and proceeds to charm the General and his circle. But after becoming infatuated with the beautiful Nastasya Filippovna, Myshkin finds himself caught up in a love triangle and drawn into a web of blackmail, betrayal, and, ultimately, murder. This new translation by David McDuff is sensitive to the shifting registers of the original Russian, capturing the nervous, elliptic flow of the narrative for a new generation of readers.",
    "genre": "music",
    "pages": 620,
    "cover": "http://covers.openlibrary.org/b/id/9412225-L.jpg"
  },
  {
    "id": "OL15130687W",
    "title": "Chemistry",
    "author": "Theodore L. Brown, H. Eugene Lemay, Bruce E. Bursten, Catherine Murphy, Patrick Woodward",
    "publishYear": 1977,
    "description": "The book provides the basis of modern chemistry that every student needs for their professional development and as preparation for more complex chemistry courses. It also offers features that facilitate learning and serve as a guide for students to acquire a conceptual understanding and the skills needed to solve problems. The first five chapters offer a microscopic and phenomenological view of chemistry, while the latter review the chemistry of nonmetals, metals, organic chemistry and biochemistry.",
    "genre": "science",
    "pages": 1072,
    "cover": "http://covers.openlibrary.org/b/id/9407725-L.jpg"
  },
  {
    "id": "OL1151518W",
    "title": "Discours de la méthode",
    "author": "René Descartes",
    "publishYear": 1644,
    "description": "No description available",
    "genre": "science",
    "pages": 185,
    "cover": "http://covers.openlibrary.org/b/id/8236442-L.jpg"
  },
  {
    "id": "OL52267W",
    "title": "The Time Machine",
    "author": "H. G. Wells",
    "publishYear": 1895,
    "description": "The Time Traveller, a dreamer obsessed with traveling through time, builds himself a time machine and, much to his surprise, travels over 800,000 years into the future. He lands in the year 802701: the world has been transformed by a society living in apparent harmony and bliss, but as the Traveler stays in the future he discovers a hidden barbaric and depraved subterranean class. Wells's transparent commentary on the capitalist society was an instant bestseller and launched the time-travel genre.",
    "genre": "science",
    "pages": 120,
    "cover": "http://covers.openlibrary.org/b/id/9009316-L.jpg"
  },
  {
    "id": "OL893415W",
    "title": "Dune",
    "author": "Frank Herbert",
    "publishYear": 1965,
    "description": "Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, heir to a noble family tasked with ruling an inhospitable world where the only thing of value is the \"spice\" melange, a drug capable of extending life and enhancing consciousness. Coveted across the known universe, melange is a prize worth killing for...\r\n\r\nWhen House Atreides is betrayed, the destruction of Paul's family will set the boy on a journey toward a destiny greater than he could ever have imagined. And as he evolves into the mysterious man known as Muad'Dib, he will bring to fruition humankind's most ancient and unattainable dream.\r\n\r\nA stunning blend of adventure and mysticism, environmentalism and politics, Dune won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction.",
    "genre": "science",
    "pages": 544,
    "cover": "http://covers.openlibrary.org/b/id/11481354-L.jpg"
  },
  {
    "id": "OL52266W",
    "title": "The Invisible Man",
    "author": "H. G. Wells",
    "publishYear": 1897,
    "description": "This book is the story of Griffin, a scientist who creates a serum to render himself invisible, and his descent into madness that follows.",
    "genre": "science",
    "pages": 182,
    "cover": "http://covers.openlibrary.org/b/id/6419199-L.jpg"
  },
  {
    "id": "OL8894965W",
    "title": "NASA/DoD aerospace knowledge diffusion research project",
    "author": "Thomas E. Pinelli",
    "publishYear": 1990,
    "description": "No description available",
    "genre": "technology",
    "pages": 26,
    "cover": "http://covers.openlibrary.org/b/id/8936636-L.jpg"
  },
  {
    "id": "OL151798W",
    "title": "Goodnight Moon",
    "author": "Margaret Wise Brown",
    "publishYear": 1947,
    "description": "Goodnight to each of the objects in the great green room: the chairs, a comb, and the air.",
    "genre": "technology",
    "pages": 32,
    "cover": "http://covers.openlibrary.org/b/id/35556-L.jpg"
  },
  {
    "id": "OL52151W",
    "title": "When the Sleeper Awakes",
    "author": "H. G. Wells",
    "publishYear": 1899,
    "description": "A troubled insomniac in 1890s England falls suddenly into a sleep-like trance, from which he does not awake for over two hundred years. During his centuries of slumber, however, investments are made that make him the richest and most powerful man on Earth. But when he comes out of his trance he is horrified to discover that the money accumulated in his name is being used to maintain a hierarchal society in which most are poor, and more than a third of all people are enslaved. Oppressed and uneducated, the masses cling desperately to one dream – that the sleeper will awake, and lead them all to freedom.",
    "genre": "technology",
    "pages": 278,
    "cover": "http://covers.openlibrary.org/b/id/574886-L.jpg"
  },
  {
    "id": "OL278851W",
    "title": "The Art of War",
    "author": "Sun Tzu",
    "publishYear": 1910,
    "description": "*The Art of War* (Chinese: 孫子兵法; lit. 'Sun Tzu's Military Method') is traditionally ascribed to Sun Tzu. It presents a philosophy of war for managing conflicts and winning battles. It is accepted as a masterpiece on strategy and has been frequently cited and referred to by generals and theorists since it was first published, translated, and distributed internationally.",
    "genre": "technology",
    "pages": 186,
    "cover": "http://covers.openlibrary.org/b/id/671290-L.jpg"
  },
  {
    "id": "OL462007W",
    "title": "Peter Pan",
    "author": "J. M. Barrie, Barbara Frith, Francis Donkin Bedford, Susan Cooper, Walt Disney, Jesús Aguado, Vicente Muñoz Puelles, Mauro Armiño",
    "publishYear": 1911,
    "description": "The adventures of the three Darling children in Never-Never Land with Peter Pan, the boy who would not grow up.",
    "genre": "technology",
    "pages": 176,
    "cover": "http://covers.openlibrary.org/b/id/8237052-L.jpg"
  },
  {
    "id": "OL1168007W",
    "title": "Animal Farm",
    "author": "George Orwell, George Orwell",
    "publishYear": 1945,
    "description": "Animal Farm is a brilliant political satire and a powerful and affecting story of revolutions and idealism, power and corruption. 'All animals are equal. But some animals are more equal than others.' Mr Jones of Manor Farm is so lazy and drunken that one day he forgets to feed his livestock. The ensuing rebellion under the leadership of the pigs Napoleon and Snowball leads to the animals taking over the farm. Vowing to eliminate the terrible inequities of the farmyard, the renamed Animal Farm is organised to benefit all who walk on four legs. But as time passes, the ideals of the rebellion are corrupted, then forgotten. And something new and unexpected emerges..",
    "genre": "animal stories",
    "pages": 130,
    "cover": "http://covers.openlibrary.org/b/id/11261770-L.jpg"
  },
  {
    "id": "OL26460746W",
    "title": "Tale of Peter Rabbit",
    "author": "Beatrix Potter, Blackwell North America., Jean Little, David Hately, J. K. Jomkhwan, Lisa McCue",
    "publishYear": 1920,
    "description": "One of the best known and loved children's stories is the story of naughty Peter Rabbit and his misadventures as he is chased around a garden.",
    "genre": "animal stories",
    "pages": 32,
    "cover": "http://covers.openlibrary.org/b/id/2557658-L.jpg"
  },
  {
    "id": "OL8193497W",
    "title": "A Christmas Carol",
    "author": "Charles Dickens",
    "publishYear": 1843,
    "description": "An allegorical novella descibing the rehabilitation of bitter, miserly businessman Ebenezer Scrooge. The reader is witness to his transformation as Scrooge is shown the error of his ways by the ghost of former partner Jacob Marley and the spirits of Christmas past, present and future. The first of the Christmas books (Dickens released one a year from 1843&ndash;1847) it became an instant hit.",
    "genre": "animal stories",
    "pages": 114,
    "cover": "http://covers.openlibrary.org/b/id/13299222-L.jpg"
  },
  {
    "id": "OL483391W",
    "title": "Among Us Story 1",
    "author": "Johnny Hotbody",
    "publishYear": 1952,
    "description": "Some Pig.\r\nThese are the words in Charlotte's Web, high in the barn. Her spiderweb tells of her feelings for a little pig named Wilbur, as well as her feelings of a little girl named Fern...who loves Wilbur, too. Their love has been shared by millions of readers.\r\n--back cover",
    "genre": "animal stories",
    "pages": 184,
    "cover": "http://covers.openlibrary.org/b/id/8461797-L.jpg"
  },
  {
    "id": "OL15155002W",
    "title": "The Ugly Duckling",
    "author": "Hans Christian Andersen",
    "publishYear": 1851,
    "description": "An ugly and unloved duckling turns out to be a beautiful swan.",
    "genre": "animal stories",
    "pages": 32,
    "cover": "http://covers.openlibrary.org/b/id/446546-L.jpg"
  }
]